//
//  SearchFilters.swift
//  Diplom
//
//  Created by Margarita Usova on 10.05.2024.
//

import Foundation
enum ButtonsSetupInfo{
    static let buttonsImagesNames = ["Asia", "Bakery", "Breakfast", "Cake", "Chinese", "Coffee", "CurryRice", "Fastfood", "Vegan", "Pasta", "Pizza", "Poke", "Shawarma", "Shrimp","Sushi", "Steak", "Taco", "Kavkaz"]
    static let buttonsNames = ["Азиатское", "Выпечка", "Завтрак", "Десерты", "Китайское", "Кофе", "Индийское", "Фастфуд", "Веганское", "Паста", "Пицца", "Поке", "Шаурма", "Морепродукты", "Суши", "Мясное", "Мексиканское", "Кавказское"]
}

enum AcceptablePlaceCategories{
    static let placeCategories = ["Кафе", "Пиццерия", "Столовая", "Ресторан", "Бар", "Паб", "Быстрое питание", "Суши-бар", "Кофейня", "Кондитерская", "Пекарня",  "Кофе с собой", "Еда на вынос", "Еда с собой", "Мороженое", "Бар", "Еда", ""]
}

enum AcceptableFilters{
    static let placesTypes: [String] = ["кавказский ресторан", "корейский ресторан", "раменичная", "коктейльный бар",  "поке бар","ресторан с детской комнатой", "мясной ресторан", "гастропаб", "фаст-фуд", "итальянский ресторан", "рыбный ресторан", "хинкальная", "пельменная", "пивной ресторан", "виски бар","гриль-бар", "индийский ресторан", "таверна", "пивной бар", "азиатский ресторан",  "ресторан премиум-класса", "вьетнамский ресторан", "паназиатский ресторан",  "грузинский ресторан", "бургерная", "французский ресторан", "ресторан с живой музыкой", "мексиканский ресторан", "ресторан еврейской кухни", "тайский ресторан", "кофейня с завтраками", "детское кафе",  "шашлычная", "рюмочная", "веганский ресторан", "чебуречная", "халяльный ресторан", "вегетарианский ресторан", "ресторан в ТЦ", "ресторан авторской кухни", "пироговая", "ресторан американской кухни", "ресторан с панорамным видом", "бар-клуб", "ресторан при отеле", "пончиковая", "бистро", "пышечная", "китайский ресторан", "семейный ресторан", "ресторан с летней верандой", "крафтовый бар", "блинная","танцевальный бар",  "закусочная", "ресторан русской кухни", "ресторан морепродуктов", "чайный клуб", "винный ресторан", "винотека", "трактир", "японский ресторан", "чайхана", "стейк-хаус"]
    static let prices: [String] = ["высокие", "выше среднего", "средние", "низкие"]
    static let cuisineTypes: [String] = ["рыбная", "смешанная", "восточно-европейская", "авторская", "шашлык", "морская", "тайская", "мясная","постная", "средиземноморская",  "латиноамериканская", "русская", "европейская", "итальянская", "паназиатская", "азиатская", "фьюжн", "веганская", "домашняя", "японская", "китайская", "кавказская", "грузинская", "английская", "вегетарианская", "американская", "еврейская", "восточная", "французская", "международная", "белорусская", "индийская", "мексиканская", "скандинавская"]
    static let placesFeatures: [String] = ["детская анимация", "винная карта", "проведение стендапов", "местоположение у воды", "танцпол", "своя пекарня", "можно с животными", "DJ", "бранчи", "открытая кухня", "кулинария", "круглосуточная кухня", "барная стойка", "живая музыка", "меню на английском", "бесплатная парковка", "можно с ноутбуком", "настольные игры", "есть банкетный зал"]
}
